trackingSystem/app/Controllers/admin/TrackingController.php

SELECT *
FROM `orders`
ORDER BY `id` DESC
---
    public function search()
    {
        if (!$this->request->isAJAX()) {
            return $this->response->setJSON(['success' => false, 'message' => 'Invalid Request']);
        }
        if(!haspermission(session('user_data')['role'],'view_tracking')) {
             return $this->response->setJSON(['success' => true, 'orders'=>[], 'message' => 'Permission Denied']);
        }

        $search = $this->request->getGet('search');
        $filter = $this->request->getGet('filer') ?? 0;

        // if (!empty($filter) && $filter !== "all") {
        //     $branches = $this->orderModel->where('status', $filter);
        // }
        $orders = $this->orderModel->orderBy('id', 'DESC')->findAll();