trackingSystem/app/Controllers/Notification.php

    function notifications(){
        $notifications = new NotificationModel();

        $role = session('user_data')['role'];

        if ($role != 1)
        {
            $notify = ($role == 2 ? $notifications->getBranchNotifications()  : ($role ==5 ? $notifications->getStaffNotifications() : NULL) );
        }else
        {
            $notify = $notifications->where('is_read',0)->findAll();
---
SELECT *
FROM `notifications`
WHERE `is_read` = 0