trackingSystem/app/Controllers/TrackingController.php

SELECT *
FROM `orders`
WHERE `tracking_id` = '4455108291'
 LIMIT 1
---
    public function trackingInfo($trackingId) {
        $orderModel = new OrderModel();
        $OrderTrackingModel = new OrderTrackingModel();
        $orderTimeline = [];
        $orderInfos = [];

        $order = $orderModel->where('tracking_id',$trackingId)->first();

SELECT *
FROM `order_tracking`
WHERE `order_id` = '44'
ORDER BY `id` desc
---
                curl_close($curl);
                $apiTracking = json_decode($response);

            $orderInfo = $OrderTrackingModel->where('order_id',$order['id'])->orderBy('id desc')->findAll();